app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.build(comment_params)
    @comment.user = current_user

    if @comment.save
---
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "hi\n"], ["post_id", 1], ["user_id", 1], ["created_at", "2024-06-19 09:33:11.031706"], ["updated_at", "2024-06-19 09:33:11.031706"]]

  def set_post
    @post = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]