app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "posts"
---
  def index
    @q = Post.ransack(params[:q])
    @posts = if params[:search]
               Post.search_full_text(params[:search]).page(params[:page]).per(5)